#include <stdio.h>

/* Задача 3. Разность двух чисел */
int main() {
    int a, b;
    printf("Введите два целых числа через пробел\n");
    scanf("%d%d", &a, &b);
    printf("%d\n", (a - b));
    return 0;
}